In [59]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [60]:
%%sql

# create database Aggregations;
use Aggregations;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [61]:
%%sql
CREATE TABLE CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'customertransactions' already exists
[SQL: CREATE TABLE CustomerTransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(20),
    product VARCHAR(100),
    amount DECIMAL(10, 2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [62]:
%%sql

INSERT INTO CustomerTransactions VALUES
(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', 50000.00, TRUE, FALSE, 'Completed'),
(2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', 1500.00, FALSE, TRUE, 'Failed'),
(4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', 2500.00, TRUE, FALSE, 'Completed'),
(5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', 5000.00, TRUE, TRUE, 'Completed'),
(6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', 15000.00, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', 25000.00, FALSE, TRUE, 'Failed'),
(8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', 60000.00, TRUE, FALSE, 'Completed'),
(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', 12000.00, TRUE, TRUE, 'Completed'),
(10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', 55000.00, FALSE, FALSE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'customertransactions.PRIMARY'
[SQL: INSERT INTO CustomerTransactions VALUES
(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', 50000.00, TRUE, FALSE, 'Completed'),
(2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', 20000.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', 1500.00, FALSE, TRUE, 'Failed'),
(4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', 2500.00, TRUE, FALSE, 'Completed'),
(5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', 5000.00, TRUE, TRUE, 'Completed'),
(6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', 15000.00, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', 25000.00, FALSE, TRUE, 'Failed'),
(8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', 60000.00, TRUE, FALSE, 'Completed'),
(9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', 12000.00, TRUE, TRUE, 'Completed'),
(10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', 55000.00, FALSE, FALSE, 'Pending');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [63]:
%%sql
select * from CustomerTransactions

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', Decimal('1500.00'), 0, 1, 'Failed'),
 (4, 'Mobile', 'Meena', '192.168.1.4', 'Shoes', Decimal('2500.00'), 1, 0, 'Completed'),
 (5, 'Desktop', 'Karthik', '192.168.1.5', 'Watch', Decimal('5000.00'), 1, 1, 'Completed'),
 (6, 'Mobile', 'Sowmya', '192.168.1.6', 'Tablet', Decimal('15000.00'), 1, 1, 'Completed'),
 (7, 'Tablet', 'Ramesh', '192.168.1.7', 'Smartphone', Decimal('25000.00'), 0, 1, 'Failed'),
 (8, 'Desktop', 'Divya', '192.168.1.8', 'Laptop', Decimal('60000.00'), 1, 0, 'Completed'),
 (9, 'Mobile', 'Arun', '192.168.1.9', 'Smartwatch', Decimal('12000.00'), 1, 1, 'Completed'),
 (10, 'Tablet', 'Deepa', '192.168.1.10', 'Laptop', Decimal('55000.00'), 0, 0, 'Pending')]

In [64]:
%%sql

select count(*) from CustomerTransactions where (transaction_status='Failed' or transaction_status = 'Pending') and product='Tablet' ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(0,)]

In [65]:
%%sql
# select count(*) from CustomerTransactions where transaction_status in ('Failed', 'Pending') and product='Tablet' ;
select count(*) from CustomerTransactions where transaction_status not in ('Failed', 'Pending') and product='Tablet' ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1,)]

In [66]:
%%sql

# use as an alias

select sum(amount) as Revenue from CustomerTransactions where transaction_status not in ('Failed', 'Pending');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('164500.00'),)]

In [67]:
%%sql
select MIN(amount) as Minimum from CustomerTransactions where transaction_status not in ('Failed', 'Pending');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('2500.00'),)]

In [68]:
%%sql
select MAX(amount) as Maximum from CustomerTransactions where transaction_status not in ('Failed', 'Pending');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('60000.00'),)]

In [69]:
%%sql
select AVG(amount) as Average from CustomerTransactions where transaction_status not in ('Failed', 'Pending');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('23500.000000'),)]

In [70]:
%%sql

select login_device, 
sum(amount) as Cost 
from CustomerTransactions 
Group BY login_device
having Cost > 81000;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('Desktop', Decimal('85000.00')), ('Tablet', Decimal('81500.00'))]

In [71]:
%%sql

select

case
    when 8 > 10 then 'true'
    when 10 > 9 then 'yey'
    else 'false'
end 
as test;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('yey',)]

In [72]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', 5000.00),
(2, 'Priya', NULL, '98765', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '98765', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'customerdata' already exists
[SQL: CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [73]:
%%sql

SELECT 
    customer_name, 
    amount,
    CASE 
        WHEN amount > 4000 THEN 'High Spender'
        WHEN amount BETWEEN 2000 AND 4000 THEN 'Medium Spender'
        WHEN amount <= 2000 THEN 'Low Spender'
        ELSE 'No Data'
    END AS spending_category
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00'), 'High Spender'),
 ('Priya', None, 'No Data'),
 ('Arjun', Decimal('1500.00'), 'Low Spender'),
 ('Meena', Decimal('2500.00'), 'Medium Spender'),
 ('Karthik', Decimal('3000.00'), 'Medium Spender')]

In [74]:
%%sql

select customer_name,
amount,
case 
    when email is null and phone_number is null then '9999'  -- ordering matters
    when email is null  then phone_number
    else email
end  as contact 

from CustomerData

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00'), 'ravi@example.com'),
 ('Priya', None, '98765'),
 ('Arjun', Decimal('1500.00'), 'arjun@example.com'),
 ('Meena', Decimal('2500.00'), '9999'),
 ('Karthik', Decimal('3000.00'), 'karthik@example.com')]

In [75]:
%%sql

select * from CustomerTransactions LIMIT 3

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Mobile', 'Ravi', '192.168.1.1', 'Laptop', Decimal('50000.00'), 1, 0, 'Completed'),
 (2, 'Desktop', 'Priya', '192.168.1.2', 'Smartphone', Decimal('20000.00'), 1, 1, 'Completed'),
 (3, 'Tablet', 'Arjun', '192.168.1.3', 'Headphones', Decimal('1500.00'), 0, 1, 'Failed')]

In [76]:
%%sql
SELECT 
    COUNT(*) AS null_phone_count 
FROM 
    CustomerData 
WHERE 
    phone_number IS NULL;


# is null only works, where = won't work

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.

[]

In [77]:
%%sql

SELECT 
    COUNT(*) AS null_phone_count 
FROM 
    CustomerData 
WHERE 
    phone_number IS NOT NULL;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3,)]

In [78]:
%%sql

SELECT 
    id, 
    customer_name, 
    email, 
    phone_number, 
    address 
FROM 
    CustomerData 
WHERE 
    email IS NULL 
    OR phone_number IS NULL 
    OR address IS NULL;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(2, 'Priya', None, '98765', 'Bangalore'),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad'),
 (4, 'Meena', None, None, 'Mumbai'),
 (5, 'Karthik', 'karthik@example.com', '98765', None)]

In [79]:
%%sql

SELECT * 
FROM CustomerData 
WHERE email = NULL;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [80]:
%%sql

SELECT 
    customer_name, 
    COALESCE(amount, 0) AS adjusted_amount 
FROM 
    CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00')),
 ('Priya', Decimal('0.00')),
 ('Arjun', Decimal('1500.00')),
 ('Meena', Decimal('2500.00')),
 ('Karthik', Decimal('3000.00'))]

In [81]:
%%sql

SELECT customer_name, IFNULL(amount, 0) AS adjusted_amount FROM CustomerData;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Ravi', Decimal('5000.00')),
 ('Priya', Decimal('0.00')),
 ('Arjun', Decimal('1500.00')),
 ('Meena', Decimal('2500.00')),
 ('Karthik', Decimal('3000.00'))]

In [85]:
%%sql

CREATE TABLE CustomerDetails (
    id INT PRIMARY KEY AUTO_INCREMENT,
    customer_name VARCHAR(100),
    city VARCHAR(100),
    phone_number VARCHAR(20)
);

INSERT INTO CustomerDetails (customer_name, city, phone_number) VALUES
('Alice Johnson', 'New York', '1234567890'),
('Bob Smith', 'Los Angeles', NULL),
('Charlie Brown', 'Chicago', '9876543210'),
('Diana Prince', 'Metropolis', '5551112222'),
('Ethan Hunt', 'San Francisco', '4445556666'),
('Fiona Gallagher', 'Detroit', NULL),
('George Lucas', 'San Jose', '9998887777'),
('Hannah Montana', 'Nashville', '2223334444'),
('Ian McKellen', 'London', '3334445555'),
('Jack Sparrow', 'Caribbean', NULL);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
10 rows affected.

[]

In [86]:
%%sql

SELECT 
    id,
    customer_name,
    # -- Extract the length of the customer name
    LENGTH(customer_name) AS name_length,
    
    # -- Convert customer name to uppercase and lowercase
    UPPER(customer_name) AS uppercase_name,
    LOWER(customer_name) AS lowercase_name,
    
    # -- Concatenate city and phone number with formatting
    CONCAT(city, ' - ', COALESCE(phone_number, '00000')) AS contact_info,
    
    # -- Extract a substring from the customer name
    SUBSTRING(customer_name, 1, 5) AS name_prefix,
    
    # -- Trim whitespace from a sample city string
    TRIM('   ExampleCity   ') AS trimmed_city,
    
    # -- Pad customer name on the left and right
    LPAD(customer_name, 15, '*') AS left_padded_name,
    RPAD(customer_name, 15, '-') AS right_padded_name,
    
    # -- Replace spaces in customer name with underscores
    REPLACE(customer_name, ' ', '_') AS updated_name,
    
    # -- Find the position of the letter 'a' in customer name
    INSTR(customer_name, 'a') AS position_of_a,
    
    # -- Extract the first 5 and last 5 characters from the customer name
    LEFT(customer_name, 5) AS first_5_chars,
    RIGHT(customer_name, 5) AS last_5_chars,
    
    # -- Reverse the customer name
    REVERSE(customer_name) AS reversed_name,
    
    # -- Format a sample number
    FORMAT(9876543210, 2) AS formatted_number
    
FROM 
    CustomerDetails;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 'Alice Johnson', 13, 'ALICE JOHNSON', 'alice johnson', 'New York - 1234567890', 'Alice', 'ExampleCity', '**Alice Johnson', 'Alice Johnson--', 'Alice_Johnson', 1, 'Alice', 'hnson', 'nosnhoJ ecilA', '9,876,543,210.00'),
 (2, 'Bob Smith', 9, 'BOB SMITH', 'bob smith', 'Los Angeles - 00000', 'Bob S', 'ExampleCity', '******Bob Smith', 'Bob Smith------', 'Bob_Smith', 0, 'Bob S', 'Smith', 'htimS boB', '9,876,543,210.00'),
 (3, 'Charlie Brown', 13, 'CHARLIE BROWN', 'charlie brown', 'Chicago - 9876543210', 'Charl', 'ExampleCity', '**Charlie Brown', 'Charlie Brown--', 'Charlie_Brown', 3, 'Charl', 'Brown', 'nworB eilrahC', '9,876,543,210.00'),
 (4, 'Diana Prince', 12, 'DIANA PRINCE', 'diana prince', 'Metropolis - 5551112222', 'Diana', 'ExampleCity', '***Diana Prince', 'Diana Prince---', 'Diana_Prince', 3, 'Diana', 'rince', 'ecnirP anaiD', '9,876,543,210.00'),
 (5, 'Ethan Hunt', 10, 'ETHAN HUNT', 'ethan hunt', 'San Francisco - 4445556666', 'Ethan', 'ExampleCity', '*****Ethan Hunt', 'Ethan Hunt-----', 'Ethan_Hunt', 4, 'Ethan', ' Hunt', 'tnuH nahtE', '9,876,543,210.00'),
 (6, 'Fiona Gallagher', 15, 'FIONA GALLAGHER', 'fiona gallagher', 'Detroit - 00000', 'Fiona', 'ExampleCity', 'Fiona Gallagher', 'Fiona Gallagher', 'Fiona_Gallagher', 5, 'Fiona', 'agher', 'rehgallaG anoiF', '9,876,543,210.00'),
 (7, 'George Lucas', 12, 'GEORGE LUCAS', 'george lucas', 'San Jose - 9998887777', 'Georg', 'ExampleCity', '***George Lucas', 'George Lucas---', 'George_Lucas', 11, 'Georg', 'Lucas', 'sacuL egroeG', '9,876,543,210.00'),
 (8, 'Hannah Montana', 14, 'HANNAH MONTANA', 'hannah montana', 'Nashville - 2223334444', 'Hanna', 'ExampleCity', '*Hannah Montana', 'Hannah Montana-', 'Hannah_Montana', 2, 'Hanna', 'ntana', 'anatnoM hannaH', '9,876,543,210.00'),
 (9, 'Ian McKellen', 12, 'IAN MCKELLEN', 'ian mckellen', 'London - 3334445555', 'Ian M', 'ExampleCity', '***Ian McKellen', 'Ian McKellen---', 'Ian_McKellen', 2, 'Ian M', 'ellen', 'nelleKcM naI', '9,876,543,210.00'),
 (10, 'Jack Sparrow', 12, 'JACK SPARROW', 'jack sparrow', 'Caribbean - 00000', 'Jack ', 'ExampleCity', '***Jack Sparrow', 'Jack Sparrow---', 'Jack_Sparrow', 2, 'Jack ', 'arrow', 'worrapS kcaJ', '9,876,543,210.00')]

In [88]:
%%sql

CREATE TABLE Customers (
    customer_id INT PRIMARY KEY AUTO_INCREMENT,
    customer_name VARCHAR(100),
    city VARCHAR(100),
    phone_number VARCHAR(20)
);

CREATE TABLE Orders (
    order_id INT PRIMARY KEY AUTO_INCREMENT,
    customer_id INT,
    order_date DATE,
    order_amount DECIMAL(10,2),
    FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
);

INSERT INTO Customers (customer_name, city, phone_number) VALUES
('Alice Johnson', 'New York', '1234567890'),
('Bob Smith', 'Los Angeles', '9876543210'),
('Charlie Brown', 'Chicago', '5551112222');

INSERT INTO Orders (customer_id, order_date, order_amount) VALUES
(1, '2023-05-01', 250.75),
(1, '2023-05-10', 480.20),
(2, '2023-06-15', 125.00),
(3, '2023-07-01', 999.99),
(3, '2023-07-20', 150.50);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
3 rows affected.
5 rows affected.

[]

In [89]:
%%sql

SELECT 
    customer_name, 
    (SELECT MAX(order_amount) FROM Orders) AS max_order_amount
FROM Customers;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice Johnson', Decimal('999.99')),
 ('Bob Smith', Decimal('999.99')),
 ('Charlie Brown', Decimal('999.99'))]

In [91]:
%%sql

SELECT customer_name
FROM Customers
WHERE customer_id IN (
    SELECT DISTINCT customer_id
    FROM Orders
    WHERE order_amount > 5000
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [92]:
%%sql

SELECT customer_name
FROM Customers
WHERE EXISTS (
    SELECT 1
    FROM Orders
    WHERE Orders.customer_id = Customers.customer_id
    AND order_date >= CURDATE() - INTERVAL 30 DAY
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [93]:
%%sql

SELECT 
    customer_name, 
    city,
    (SELECT SUM(order_amount) 
     FROM Orders o 
     WHERE o.customer_id = c.customer_id) AS total_orders
FROM Customers c;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice Johnson', 'New York', Decimal('730.95')),
 ('Bob Smith', 'Los Angeles', Decimal('125.00')),
 ('Charlie Brown', 'Chicago', Decimal('1150.49'))]

In [94]:
%%sql

SELECT 
    id,
    customer_name,
    name_length,
    uppercase_name,
    lowercase_name,
    contact_info,
    name_prefix,
    trimmed_city,
    left_padded_name,
    right_padded_name,
    updated_name,
    position_of_a,
    first_5_chars,
    last_5_chars,
    reversed_name,
    formatted_number
FROM (
    SELECT 
        id,
        customer_name,
        LENGTH(customer_name) AS name_length,
        UPPER(customer_name) AS uppercase_name,
        LOWER(customer_name) AS lowercase_name,
        CONCAT(city, ' - ', COALESCE(phone_number, '00000')) AS contact_info,
        SUBSTRING(customer_name, 1, 5) AS name_prefix,
        TRIM('   ExampleCity   ') AS trimmed_city,
        LPAD(customer_name, 15, '*') AS left_padded_name,
        RPAD(customer_name, 15, '-') AS right_padded_name,
        REPLACE(customer_name, ' ', '_') AS updated_name,
        INSTR(customer_name, 'a') AS position_of_a,
        LEFT(customer_name, 5) AS first_5_chars,
        RIGHT(customer_name, 5) AS last_5_chars,
        REVERSE(customer_name) AS reversed_name,
        FORMAT(9876543210, 2) AS formatted_number
    FROM CustomerDetails
) AS string_handling_results;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 'Alice Johnson', 13, 'ALICE JOHNSON', 'alice johnson', 'New York - 1234567890', 'Alice', 'ExampleCity', '**Alice Johnson', 'Alice Johnson--', 'Alice_Johnson', 1, 'Alice', 'hnson', 'nosnhoJ ecilA', '9,876,543,210.00'),
 (2, 'Bob Smith', 9, 'BOB SMITH', 'bob smith', 'Los Angeles - 00000', 'Bob S', 'ExampleCity', '******Bob Smith', 'Bob Smith------', 'Bob_Smith', 0, 'Bob S', 'Smith', 'htimS boB', '9,876,543,210.00'),
 (3, 'Charlie Brown', 13, 'CHARLIE BROWN', 'charlie brown', 'Chicago - 9876543210', 'Charl', 'ExampleCity', '**Charlie Brown', 'Charlie Brown--', 'Charlie_Brown', 3, 'Charl', 'Brown', 'nworB eilrahC', '9,876,543,210.00'),
 (4, 'Diana Prince', 12, 'DIANA PRINCE', 'diana prince', 'Metropolis - 5551112222', 'Diana', 'ExampleCity', '***Diana Prince', 'Diana Prince---', 'Diana_Prince', 3, 'Diana', 'rince', 'ecnirP anaiD', '9,876,543,210.00'),
 (5, 'Ethan Hunt', 10, 'ETHAN HUNT', 'ethan hunt', 'San Francisco - 4445556666', 'Ethan', 'ExampleCity', '*****Ethan Hunt', 'Ethan Hunt-----', 'Ethan_Hunt', 4, 'Ethan', ' Hunt', 'tnuH nahtE', '9,876,543,210.00'),
 (6, 'Fiona Gallagher', 15, 'FIONA GALLAGHER', 'fiona gallagher', 'Detroit - 00000', 'Fiona', 'ExampleCity', 'Fiona Gallagher', 'Fiona Gallagher', 'Fiona_Gallagher', 5, 'Fiona', 'agher', 'rehgallaG anoiF', '9,876,543,210.00'),
 (7, 'George Lucas', 12, 'GEORGE LUCAS', 'george lucas', 'San Jose - 9998887777', 'Georg', 'ExampleCity', '***George Lucas', 'George Lucas---', 'George_Lucas', 11, 'Georg', 'Lucas', 'sacuL egroeG', '9,876,543,210.00'),
 (8, 'Hannah Montana', 14, 'HANNAH MONTANA', 'hannah montana', 'Nashville - 2223334444', 'Hanna', 'ExampleCity', '*Hannah Montana', 'Hannah Montana-', 'Hannah_Montana', 2, 'Hanna', 'ntana', 'anatnoM hannaH', '9,876,543,210.00'),
 (9, 'Ian McKellen', 12, 'IAN MCKELLEN', 'ian mckellen', 'London - 3334445555', 'Ian M', 'ExampleCity', '***Ian McKellen', 'Ian McKellen---', 'Ian_McKellen', 2, 'Ian M', 'ellen', 'nelleKcM naI', '9,876,543,210.00'),
 (10, 'Jack Sparrow', 12, 'JACK SPARROW', 'jack sparrow', 'Caribbean - 00000', 'Jack ', 'ExampleCity', '***Jack Sparrow', 'Jack Sparrow---', 'Jack_Sparrow', 2, 'Jack ', 'arrow', 'worrapS kcaJ', '9,876,543,210.00')]

In [95]:
%%sql

SELECT 
    customer_name, 
    CASE 
        WHEN (SELECT SUM(order_amount) FROM Orders WHERE Orders.customer_id = Customers.customer_id) > 
             (SELECT AVG(order_amount) FROM Orders) THEN 'Above Average'
        ELSE 'Below Average'
    END AS order_category
FROM Customers;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice Johnson', 'Above Average'),
 ('Bob Smith', 'Below Average'),
 ('Charlie Brown', 'Above Average')]

In [96]:
%%sql

SELECT 
    customer_name, 
    (SELECT MAX(order_amount) 
     FROM Orders 
     WHERE order_amount < (SELECT MAX(order_amount) FROM Orders)) AS second_highest_order
FROM Customers;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice Johnson', Decimal('480.20')),
 ('Bob Smith', Decimal('480.20')),
 ('Charlie Brown', Decimal('480.20'))]